{
  "tag_name": "0.0.5",
  "name": "0.0.5",
  "body": "# Cost Explorer Enhancement - Pull Request Summary\r\n\r\nKey Features Added\r\nComprehensive Cloud Resource Cost Analysis: Extended the cost explorer to analyze all cloud resources beyond just snapshots, including compute instances, storage, and database services.\r\n\r\nMulti-Platform Support: Full cost analysis for AWS, Azure, and GCP resources with unified interface.\r\n\r\nResource-Specific Cost Calculations:\r\n\r\nAWS: EC2 instances, S3 buckets, RDS instances\r\nAzure: Virtual Machines, Storage Accounts, Disk Snapshots\r\nGCP: Compute Instances, Cloud Storage, Cloud SQL\r\nImproved Cost Visualization: Added charts to visualize costs across platforms and resource types.\r\n\r\nTechnical Improvements\r\nEnhanced Data Collection Architecture:\r\n\r\nCreated ConvertAwsDataForCostAnalysis, ConvertAzureDataForCostAnalysis, and ConvertGcpDataForCostAnalysis functions to standardize resource data.\r\nImplemented ResourceCostEstimator for detailed cost calculations beyond snapshots.\r\nDynamic Cost Calculation:\r\n\r\nInstance-type aware pricing (EC2 t2/t3/m5, Azure B/D/E series, GCP machine types)\r\nRegion-sensitive pricing with automatic regional adjustments\r\nStorage class differentiation (S3 Standard/IA/Glacier, GCP Standard/Nearline/Coldline)\r\nImproved UI Experience:\r\n\r\nModal selector for platform cost analysis\r\nDynamic tables showing resource costs by type\r\nSummary cards with total cost calculations\r\nComprehensive cost charts for visual analysis\r\nData Handling Improvements:\r\n\r\nGraceful handling when no resources found\r\nSupport for mock data to test without cloud credentials\r\nDetailed logging for debugging cost calculations\r\nUser Experience Enhancements\r\nCost Summary Dashboard: Clear overview of total costs across all resources and platforms.\r\n\r\nResource Cost Breakdown: Detailed tables showing cost per resource with region, size, and pricing details.\r\n\r\nCost Disclaimer: Transparent information about pricing sources and calculation methodology.\r\n\r\nPlatform Selection: Easy-to-use modal dialog for selecting which cloud platforms to analyze.\r\n\r\nIntegration Notes\r\nWorks with existing snapshot cost explorer functionality.\r\nUses the same pricing APIs and caching mechanisms.\r\nMaintains consistent user interface design with the rest of the application.\r\nThis enhancement delivers significant value to users by providing comprehensive cost analysis for all cloud resources, enabling better cloud cost management and optimization decisions.",
  "prerelease": false,
  "draft": false,
  "published_at": "2025-05-19T12:43:45Z",
  "repository": "MichaelCade/kollect"
}
